_articles/2013-04-22-Learning-C++.org
#+TITLE:Learning C++
#+AUTHOR:ICECREAM(氷菓)
#+EMAIL:creamidea(AT)gmail.com
#+DESCRIPTION:ICECREAM(氷菓)
#+KEYWORDS:CPlusPlus
#+OPTIONS:H:4 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t email:t
#+LINK_HOME: https://creamidea.github.io
#+STYLE:<link rel="stylesheet" type="text/css" href="../css/style.css">
#+INFOJS_OPT: view: showall toc: nil

#+BEGIN_HTML
---
layout: doc
title: Learning C++
subtitle: 学习C++笔记
categories: note
tags: CPlusPlus
---
#+END_HTML

* 前言
好的，匆忙地学习完ARM之后，立即转战C++学习。真是有意思的安排啊。おもしろい。

那么我们就开始记录吧。

* 第一课
	<2013-04-22 Mon>

  #+BEGIN_SRC c++
    #include <iostream>

    using namespace std;

    int main(int argc, char *argv[])
    {
        cout << "hi, icecream" << endl;
    }
  #+END_SRC
* 第二课
	<2013-04-23 Tue>

** 内联函数和重载函数inline
   C中宏定义注意二义性：
   #+BEGIN_SRC c
     #define max(a, b) (a)>(b)?(a):(b)
   #+END_SRC

   =inline=
   类的成员函数，提过效率。
   避免C中宏定义的二义性。
   使用1～5行的小程序。不要含有复杂的结构控制语句以及递归。
   *不能使用函数指针*

** 函数重载
   1. 函数重载与返回值无关。

   2. 有关：类型，顺序，个数

   3. 默认参数:
	  在参数列表中的某些参数有默认值时，在调用的时候会报错。代码如下：
	  #+BEGIN_SRC c
        int mul(int a, int b)
        {
             return 1;
        }

        int mul(int a, int b, int c = 0, int d = 10)
        {
             return 2;
        }
        /* 下面的代码设置默认值是不被允许的,原因是参数入栈时，没有赋值。 */
        int mul(int a=10, int b=10, int c = 0, int d)
        {
             return 2;
        }
	  #+END_SRC

** 多态
*** 静态多态：
* 第三课
	<2013-04-25 Thu>

** 动态内存分配
*** 堆空间：
    C:
      =malloc= / =calloc= / =realloc= | =free=

    C++:
      =new= | =delete= (两个操作符)

      #+BEGIN_SRC C
        int * p = new int;              /* 在堆上面分配空间sizeof(int) */
        int * p = new int();            /* 初始化为0（加上()） */
      #+END_SRC

*** &: 取地址/引用
    #+BEGIN_SRC c
      int *p = &num;                  /* 取地址符 */
      int &p1 = num;                  /* 引用 */
    #+END_SRC
* 第四课  
  1. 类的拷贝：
	  浅拷贝 \\
	  深拷贝

  2. 友元类和友元方法
* 第五课 
	<2013-05-16 Thu>
	
	1. 虚基类
	   class A: virtual public b

  不产生二义性
  画一个图真难啊
	#+BEGIN_EXAMPLE
  #+BEGIN_DITAA asciiExample.png -o -r -S
  +--------------+
  |              |
  | Hello World! |
  |              |
  +--------------+
  #+END_DITAA
	
	#+END_EXAMPLE

* 写在最后
	最后居然还是草草收场，一个没有任何实现的CuteCube!!
